Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: བཅོམ་ལྡན་འདས་བདག་ཀུན་དུ་མཐའ་ཡས་པའི་སླད་དུ་གཟུགས་ཀུན་དུ་མཐའ་ཡས་པའོ།
en: Blessed Lord, the limitlessness of physical forms is due to the limitlessness of the self.” “

source: །གསོལ་པ་བཅོམ་ལྡན་འདས་ཅིའི་སླད་དུ་བདག་ཀུན་དུ་མཐའ་ཡས་པས་གཟུགས་ཀུན་དུ་མཐའ་ཡས་པ་རྣམ་པར་དག་པ་ལགས།
en: Blessed Lord, why is the purity of the limitlessness of physical forms due to the limitlessness of the self?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། མཐའ་ལས་འདས་པ་སྟོང་པ་ཉིད་དང་། ཐོག་མ་དང་ཐ་མ་མེད་པ་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་རོ།
en: That is due to the emptiness of the unlimited and the emptiness of that which has neither beginning nor end,” replied the Blessed One. “

source: །གསོལ་པ་བཅོམ་ལྡན་འདས་བདག་ཀུན་དུ་མཐའ་ཡས་པའི་སླད་དུ་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཀུན་དུ་མཐའ་ཡས་པའོ།
en: Blessed Lord, the limitlessness of feelings, perceptions, formative predispositions, and consciousness is due to the limitlessness of the self.” “

source: །གསོལ་པ་བཅོམ་ལྡན་འདས་ཅིའི་སླད་དུ་བདག་ཀུན་དུ་མཐའ་ཡས་པས་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཀུན་དུ་མཐའ་ཡས་པ་རྣམ་པར་དག་པ་ལགས།
en: Blessed Lord, why is the purity of the limitlessness of feelings, perceptions, formative predispositions, and consciousness due to the limitlessness of the self?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། མཐའ་ལས་འདས་པ་སྟོང་པ་ཉིད་དང་། ཐོག་མ་དང་ཐ་མ་མེད་པ་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་རོ། །གསོལ་པ།
en: That is due to the emptiness of the unlimited and the emptiness of that which has neither beginning nor end,” replied the Blessed One. “

source: བཅོམ་ལྡན་འདས་བདག་ཀུན་དུ་མཐའ་ཡས་པའི་སླད་དུ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཀུན་དུ་མཐའ་ཡས་པའོ།
en: Blessed Lord, the limitlessness of [other phenomena, attributes, and attainments], up to and including all-aspect omniscience, is due to the limitlessness of the self.” “

source: །གསོལ་པ་བཅོམ་ལྡན་འདས་ཅིའི་སླད་དུ། བདག་ཀུན་དུ་མཐའ་ཡས་པས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀུན་དུ་མཐའ་ཡས་པ་རྣམ་པར་དག་པ་ལགས།
en: Blessed Lord, why is the purity of the limitlessness of all-aspect omniscience [and so forth] due to the limitlessness of the self?” “

source: །གསོལ་པ་བཅོམ་ལྡན་འདས་གང་དེ་ལྟར་རྟོགས་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ།
en: Blessed Lord, it is the perfection of wisdom of the bodhisattva great beings through which this is realized.” “

source: བཅོམ་ལྡན་འདས་ཅིའི་སླད་དུ་གང་དེ་ལྟར་རྟོགས་པ་དེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལགས།
en: II-III: 164} “Blessed Lord, why is it the perfection of wisdom of the bodhisattva great beings through which this is realized?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ཀྱི་ཕྱིར་རོ།
en: Subhūti, it is so owing to knowledge of the path,” replied the Blessed One. {

source: བཅོམ་ལྡན་འདས་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཚུ་རོལ་གྱི་འགྲམ་འམ། ཕ་རོལ་གྱི་འགྲམ་འམ། གཉིས་ཀྱི་དབུས་ན་མི་གནས་ན། དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ།
en: II-III: 165} “Blessed Lord, when bodhisattva great beings practice the perfection of wisdom, if they do not dwell on the near shore, the far shore, or the midstream between these two, this denotes the perfection of wisdom that bodhisattva great beings have.” “

source: བཅོམ་ལྡན་འདས་ཅིའི་སླད་དུ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཚུ་རོལ་གྱི་འགྲམ་འམ། ཕ་རོལ་གྱི་འགྲམ་འམ། གཉིས་ཀའི་དབུས་ན་མི་གནས་ཤིང་ཤིན་དུ་རྣམ་པར་དག་པ་ལགས།
en: Blessed Lord, why is it that when bodhisattva great beings practice the perfection of wisdom, they do not dwell on the near shore, the far shore, or the midstream between these two, and are [therefore] absolutely pure?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དུས་གསུམ་མཉམ་པ་ཉིད་ཀྱི་ཕྱིར་རོ།
en: Subhūti, this is owing to the sameness of the three times,” replied the Blessed One. “

source: །གསོལ་པ་བཅོམ་ལྡན་འདས་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་བའི་རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་ཐབས་མི་མཁས་པས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལ་དམིགས་པའི་ཚུལ་དུ་འདུ་ཤེས་སུ་བགྱིད་པ་ནི། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་གསོག་དུ་འབྱིན་པའོ། །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རིང་དུ་སྤོང་བའོ།
en: Blessed Lord, noble sons or noble daughters who follow the vehicle of the bodhisattvas but lack skillful means will perceive this perfection of wisdom by way of apprehending; they will undervalue the perfection of wisdom and abandon the perfection of wisdom.” “

source: །རབ་འབྱོར་དེ་ནི་མིང་དུ་ཡང་ཆགས་པ་ཡིན། མཚན་མར་ཡང་ཆགས་པ་ཡིན།
en: Subhūti, this indeed denotes attachment to names and attachment to signs!” “

source: གསོལ་པ་བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་མིང་དུ་ཡང་ཆགས་ཤིང་མཚན་མར་ཡང་ཆགས་པ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, how does this denote attachment to names and attachment to signs?” “

source: རབ་འབྱོར་འདི་ལ་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ། མིང་དུ་འཛིན་ཏམ་མཚན་མར་འཛིན་ན། དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་མིང་དང་མཚན་མར་འཛིན་ཅིང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ཆགས་པས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་གསོག་དུ་འབྱིན་ཏོ།
en: Subhūti,” replied the Blessed One, “if noble sons or noble daughters who follow the vehicle of the bodhisattvas grasp the perfection of wisdom as a name or grasp it as a sign, then, in grasping the perfection of wisdom as a name or as a sign, they will be attached to the perfection of wisdom, for which reason they will undervalue the perfection of wisdom and abandon the perfection of wisdom.

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རིང་དུ་སྤོང་ངོ་། །རབ་འབྱོར་གལ་ཏེ་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་མཚན་མར་འཛིན་ཅིང་། དེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་མཚན་མར་བཟུང་ནས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པས་རློམ་སེམས་སུ་བྱེད་ན། དེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པས་རློམ་སེམས་སུ་བྱེད་ཅིང་།
en: Subhūti, if noble sons or noble daughters who follow the vehicle of the bodhisattvas grasp the perfection of wisdom as a sign, and, having grasped it as a sign, give rise to conceits on the basis of the perfection of wisdom, then, in making assumptions on the basis of the perfection of wisdom, they will be attached to the perfection of wisdom, for which reason they will undervalue the perfection of wisdom and abandon the perfection of wisdom.”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ཆགས་པས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་གསོག་དུ་འབྱིན་ཏོ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རིང་དུ་སྤོང་ངོ་། །རབ་འབྱོར་གྱིས་གསོལ་པ་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཡང་དེ་ལྟར་ལེགས་པར་བཤད་ཅིང་ལེགས་པར་བསྟན་ལ་ཆགས་པ་དང་མ་ཆགས་པ་དེ་དག་ཀྱང་མ་མཆིས་པ་ངོ་མཚར་ཆེའོ།
en: Subhūti then said, “Blessed Lord, how wonderful it is that this perfection of wisdom has been eloquently explained and excellently revealed in that manner to bodhisattva great beings, and that they are neither attached nor unattached to it!” {

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས།
en: Ki.

source: ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཆགས་པ་ནི་གང་ཡིན།
en: II-III: 166} Then the venerable Śāradvatīputra asked the venerable Subhūti, “Venerable Subhūti, what is the attachment that bodhisattva great beings might have and what is their nonattachment?” “

source: མ་ཆགས་པ་ནི་གང་ཡིན་རབ་འབྱོར་གྱིས་སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་ཐབས་མི་མཁས་པས། གཟུགས་སྟོང་པའོ་ཞེས་བྱ་བར་འདུ་ཤེས་ན་ཆགས་པའོ།
en: Venerable Śāradvatīputra,” replied Subhūti, “if noble sons or noble daughters who follow the vehicle of the bodhisattvas, lacking in skillful means, perceive that physical forms are empty, then they are attached.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་སྟོང་པའོ་ཞེས་བྱ་བར་འདུ་ཤེས་ན་ཆགས་པའོ།
en: If they perceive that feelings, perceptions, formative predispositions, and consciousness are empty, then they are attached.

source: །སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་སྟོང་པའོ་ཞེས་བྱ་བར་འདུ་ཤེས་ན་ཆགས་པའོ།
en: If they perceive that the sense fields, the sensory elements, and the links of dependent origination are empty, then they are attached.

source: །སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོང་པའོ་ཞེས་བྱ་བར་འདུ་ཤེས་ན་ཆགས་པའོ།
en: If they perceive that the perfection of generosity is empty, then they are attached.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོང་པའོ།
en: If they perceive that the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom are empty, then they are attached.

source: །ཞེས་བྱ་བར་འདུ་ཤེས་ན་ཆགས་པའོ། །ནང་སྟོང་པ་ཉིད་སྟོང་པའོ་ཞེས་བྱ་བར་འདུ་ཤེས་ན་ཆགས་པའོ།
en: If they perceive that the emptiness of internal phenomena is empty, then they are attached.

source: །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་སྟོང་པའོ་ཞེས་བྱ་བར་འདུ་ཤེས་ན་ཆགས་པའོ།།
en: If they perceive that the [other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, are empty, then they are attached.

source: དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་སྟོང་པའོ་ཞེས་བྱ་བར་འདུ་ཤེས་ན་ཆགས་པའོ། །ཡང་དག་པར་སྤོང་བ་དང་།
en: If they perceive that the applications of mindfulness are empty, then they are attached.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་སྟོང་པའོ་ཞེས་བྱ་བར་འདུ་ཤེས་ན་ཆགས་པའོ།
en: If they perceive that the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path are empty, then they are attached.

source: །འཕགས་པའི་བདེན་པ་རྣམས་སྟོང་བའོ་ཞེས་བྱ་བར་འདུ་ཤེས་ན་ཆགས་པའོ།
en: If they perceive that the truths of the noble ones are empty, then they are attached.

source: །བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་སྟོང་པའོ། །ཞེས་བྱ་བར་འདུ་ཤེས་ན་ཆགས་པའོ།
en: If they perceive that the meditative concentrations, the immeasurable attitudes, and the formless absorptions are empty, then they are attached.

source: །རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་མངོན་པར་ཤེས་པ་རྣམས་སྟོང་པའོ་ཞེས་བྱ་བར་འདུ་ཤེས་ན་ཆགས་པའོ།
en: If they perceive that the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, and the extrasensory powers are empty, then they are attached.

source: །ཏིང་ངེ་འཛིན་དང་གཟུངས་ཀྱི་སྒོ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་སྟོང་པའོ་ཞེས་བྱ་བར་འདུ་ཤེས་ན་ཆགས་པའོ།
en: If they perceive that the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, and the eighteen distinct qualities of the buddhas are empty, then they are attached.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་སྟོང་པའོ་ཞེས་བྱ་བར་འདུ་ཤེས་ན་ཆགས་པའོ།
en: If they perceive that [the attainments], up to and including all-aspect omniscience, are empty, then they are attached. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་ཐབས་མི་མཁས་པས་འདས་པའི་ཆོས་རྣམས་ལ། འདས་པའི་ཆོས་ཤེས་བྱ་བར་འདུ་ཤེས་ན་ཆགས་པའོ།
en: Moreover, Venerable Śāradvatīputra, if noble sons or noble daughters who follow the vehicle of the bodhisattvas, lacking in skillful means, perceive that phenomena of the past are phenomena of the past, then they are attached.

source: །མ་འོངས་པའི་ཆོས་རྣམས་ལ་མ་འོངས་པའི་ཆོས་ཤེས་བྱ་བར་འདུ་ཤེས་ན་ཆགས་པའོ།
en: If they perceive that phenomena of the future are phenomena of the future, then they are attached.

source: །ད་ལྟར་བྱུང་བའི་ཆོས་རྣམས་ལ་ད་ལྟར་བྱུང་བའི་ཆོས་ཤེས་བྱ་བར་འདུ་ཤེས་ན་ཆགས་པའོ།
en: If they perceive that phenomena of the present are phenomena of the present, then they are attached. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དམིགས་པའི་ཚུལ་དུ། སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་བ་ནས། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ན་ཆགས་པའོ། །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: Moreover, Venerable Śāradvatīputra, if noble sons or noble daughters who follow the vehicle of the bodhisattvas practice the perfection of generosity by way of apprehending, commencing from the time when they first begin to set their mind on enlightenment, then they are attached; and if they practice the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom [in that apprehending manner], then they are attached. “

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ན་ཆགས་པའོ། །ནང་སྟོང་པ་ཉིད་ལ་སྤྱོད་ན་ཆགས་པའོ།
en: If they practice the emptiness of internal phenomena [in that apprehending manner], then they are attached.

source: དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ལ་སྤྱོད་ན་ཆགས་པའོ།
en: If they practice [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, [in that apprehending manner], then they are attached.

source: །དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ལ་སྤྱོད་ན་ཆགས་པའོ། །ཡང་དག་པར་སྤོང་བ་དང་།
en: If they practice the applications of mindfulness [in that apprehending manner], then they are attached.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ལ་སྤྱོད་ན་ཆགས་པའི།
en: If they practice the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path [in that apprehending manner], then they are attached.

source: །འཕགས་པའི་བདེན་པ་རྣམས་ལ་སྤྱོད་ན་ཆགས་པའོ།
en: If they practice the truths of the noble ones [in that apprehending manner], then they are attached.

source: །བསམ་གཏན་དང་ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་ལ་སྤྱོད་ན་ཆགས་པའོ། རྣམ་པར་ཐར་པ་དང་།
en: If they practice the meditative concentrations, the immeasurable attitudes, and the formless absorptions [in that apprehending manner], then they are attached.

source: མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་།
en: If they practice the truths of the noble ones [in apprehending that manner], then they are attached. If they practice the meditative concentrations, the immeasurable attitudes, and the formless absorptions [in that apprehending manner], then they are attached.

source: སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་ལ་སྤྱོད་ན་ཆགས་པའོ།
en: If they practice the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, {Ki.

source: །ཏིང་ངེ་འཛིན་དང་།
en: II-III: 167} and the extrasensory powers [in that apprehending manner], then they are attached.

source: གཟུངས་ཀྱི་སྒོ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ལ་སྤྱོད་ན་ཆགས་པའོ།
en: If they practice the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, and the eighteen distinct qualities of the buddhas [in that apprehending manner], then they are attached.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ལ་སྤྱོད་ན་ཆགས་པའོ།
en: If they practice [the attainments], up to and including all-aspect omniscience, [in that apprehending manner], then they are attached. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གང་ཡང་འདི་སྐད་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་རྣམས་ཀྱི་ཆགས་པ་མེད་པ་གང་ཞེས་ཟེར་བ་ནི།
en: Venerable Śāradvatīputra, you also asked, ‘What is the nonattachment of bodhisattva great beings who practice the perfection of wisdom?’

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐབས་མཁས་པ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ནི། གཟུགས་ལ་གཟུགས་ཤེས་བྱ་བ་འདུ་ཤེས་པ་མེད་དོ།
en: Venerable Śāradvatīputra, bodhisattva great beings, skilled in means, who practice the perfection of wisdom, do not perceive that physical forms are physical forms.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ལ་རྣམ་པར་ཤེས་པ་ཞེས་བྱ་བར་འདུ་ཤེས་པ་མེད་དོ།
en: They do not perceive that feelings, perceptions, formative predispositions, and consciousness are consciousness [and so forth].

source: །འདས་པའི་ཆོས་རྣམས་ལ་འདས་པའི་ཆོས་ཤེས་བྱ་བར་འདུ་ཤེས་པ་མེད་དོ།
en: They do not perceive that phenomena of the past are phenomena of the past.

source: །མ་འོངས་པའི་ཆོས་རྣམས་ལ་མ་འོངས་པའི་ཆོས་ཤེས་བྱ་བར་འདུ་ཤེས་མེད་དོ།
en: They do not perceive that phenomena of the future are phenomena of the future.

source: །ད་ལྟར་བྱུང་བའི་ཆོས་རྣམས་ལ་ད་ལྟར་བྱུང་བའི་ཆོས་ཤེས་བྱ་བར་འདུ་ཤེས་པ་མེད་དོ།
en: They do not perceive that phenomena of the present are phenomena of the present. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐབས་མཁས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ནི། འདི་སྙམ་དུ་བདག་གིས་སྦྱིན་པ་ཞིག་སྦྱིན་ནོ།
en: Venerable Śāradvatīputra, bodhisattva great beings, skilled in means, who practice the perfection of wisdom, do not think, ‘I should give a gift!

source: །འདི་ལ་སྦྱིན་པ་འདི་ལྟ་བུ་ཞིག་སྦྱིན་ཞེ་འམ།
en: I should give this sort of gift to that person!’;

source: བདག་གི་ས་ནི་ཚུལ་ཁྲིམས་ཤིག་བསྲུང་ངོ་།
en: or ‘I should maintain ethical discipline!

source: །ཚུལ་ཁྲིམས་འདི་ལྟ་བུ་ཞིག་བསྲུང་ངོ་ཞེ་འམ་བདག་གིས་ནི་བཟོད་པ་ཞིག་བསྒོམ་མོ།
en: I should maintain this sort of ethical discipline!’; or ‘I should cultivate tolerance!

source: །བཟོད་པ་འདི་ལྟ་བུ་ཞིག་བསྒོམ་མོ་ཞེ་འམ།
en: I should cultivate this sort of tolerance!’;

source: བདག་གིས་ནི་བརྩོན་འགྲུས་ཤིག་བརྩམ་མོ།
en: or ‘I should undertake perseverance!

source: །བརྩོན་འགྲུས་འདི་ལྟ་བུ་ཞིག་བརྩམ་མོ་ཞེ་འམ།
en: I should undertake this sort of perseverance!;

source: བདག་གིས་ནི་བསམ་གཏན་ཞིག་ལ་མཉམ་པར་གཞག་གོ།
en: or ‘I should be absorbed in meditative concentration!

source: །བསམ་གཏན་འདི་ལྟ་བུ་ཞིག་ལ་མཉམ་པར་གཞག་གོ་ཞེ་འམ་བདག་གིས་ནི་ཤེས་རབ་ཅིག་བསྒོམ་མོ།
en: I should be absorbed in this sort of meditative concentration!’; or ‘I should cultivate wisdom!

source: །ཤེས་རབ་འདི་ལྟ་བུ་ཞིག་བསྒོམ་མོ་ཞེ་འམ་བདག་གིས་ནི་བསོད་ནམས་ཞིག་བསྐྱེད་དོ།
en: I should cultivate this sort of wisdom!’; or ‘I should generate merit!

source: །བསོད་ནམས་འདི་ལྟ་བུ་ཞིག་བསྐྱེད་དོ།
en: I should generate this sort of merit!

source: །བསོད་ནམས་འདི་ཙམ་ཞིག་བསྐྱེད་དོ།
en: I should generate this much merit!’;

source: ཞེའམ་བདག་གིས་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པར་ཆུད་པར་བྱའོ་ཞེའམ།
en: or ‘I should enter a bodhisattva’s full maturity.

source: བདག་གིས་ནི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱའོ། །ཞེ་འམ་བདག་གིས་ནི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱའོ་ཞེའམ།
en: I should purify the buddhafields!’;

source: བདག་གིས་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་བྱའོ་སྙམ་དུ་སེམས་པ་མེད་དེ།
en: or ‘I should attain all-aspect omniscience!’ “

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐབས་མཁས་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ལ་ནི། རྣམ་པར་རྟོག་པ་དེ་ལྟ་བུ་ཐམས་ཅད་དང་ནང་སྟོང་པ་ཉིད་དང་། ཕྱི་སྟོང་པ་ཉིད་དང་། ཕྱི་ནང་སྟོང་པ་ཉིད་དང་། སྟོང་པ་ཉིད་སྟོང་པ་ཉིད་དང་། ཆེན་པོ་སྟོང་པ་ཉིད་དང་དོན་དམ་པ་སྟོང་པ་ཉིད་དང་། འདུས་བྱས་སྟོང་པ་ཉིད་དང་། འདུས་མ་བྱས་སྟོང་པ་ཉིད་དང་། མཐའ་ལས་འདས་པ་སྟོང་པ་ཉིད་དང་། ཐོག་མ་དང་ཐ་མ་མེད་པ་སྟོང་པ་ཉིད་དང་། དོར་བ་མེད་པ་སྟོང་པ་ཉིད་དང་། རང་བཞིན་སྟོང་པ་ཉིད་དང་། ཆོས་ཐམས་ཅད་སྟོང་པ་ཉིད་དང་། རང་གི་མཚན་ཉིད་སྟོང་པ་ཉིད་དང་། མི་དམིགས་པ་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པ་སྟོང་པ་ཉིད་དང་། ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་དང་།
en: Venerable Śāradvatīputra, for bodhisattva great beings, skilled in means, who practice the perfection of wisdom, all such conceptual thoughts are nonexistent and will not come about owing to the emptiness of internal phenomena, the emptiness of external phenomena, the emptiness of external and internal phenomena, the emptiness of emptiness, the emptiness of great extent, the emptiness of ultimate reality, the emptiness of conditioned phenomena, the emptiness of unconditioned phenomena, the emptiness of that which is beyond extremes, the emptiness of that which has neither beginning nor end, the emptiness of nonexclusion, the emptiness of inherent existence, the emptiness of all phenomena, the emptiness of intrinsic defining characteristics, the emptiness of nonapprehensibility, the emptiness of nonentities, the emptiness of essential nature, and the emptiness of the essential nature of nonentities. “

source: དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་མེད་ཅིང་མི་རྒྱུ་སྟེ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐབས་མཁས་པ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཆགས་པ་མེད་པ་དག་གོ། དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས།
en: Venerable Śāradvatīputra, these are indicative of the nonattachment of bodhisattva great beings, skilled in means, who practice the perfection of wisdom.”

source: ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བཙུན་པ་རབ་འབྱོར་རྣམ་གྲངས་གང་གིས་ན། བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་རྣམས་ཀྱིས་ཆགས་པར་འགྱུར་བ་ཡིན་དེ་སྐད་ཅེས་སྨྲས་པ་དང་། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཀཽ་ཤི་ཀ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་སེམས་སུ་འདུ་ཤེས་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པར་འདུ་ཤེས་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པར་འདུ་ཤེས་པ་དང་། ནང་སྟོང་པ་ཉིད་དུ་འདུ་ཤེས་པ་དང་། ཕྱི་སྟོང་པ་ཉིད་དུ་འདུ་ཤེས་པ་དང་། ཕྱི་ནང་སྟོང་པ་ཉིད་དུ་འདུ་ཤེས་པ་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་འདུ་ཤེས་པ་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་སུ་འདུ་ཤེས་པ་དང་།
en: Thereupon Śakra, mighty lord of the gods, asked the venerable Subhūti, “Blessed Subhūti, how can one say that noble sons or noble daughters who follow the vehicle of the bodhisattvas would be attached?”
